import math

# Завдання 1
print("\tЗавдання 1\n")

print("ЦДПУ ім. В. Винниченка")
print("Фізико-математичний ", "факультет")
a = "Інформатика"
print(a)
b = 6.9
print("b = ",b)

##########################################################################################
# Завдання 2
print("\n\tЗавдання 2\n")

print("Program 'Game Over' 2.0") #просто текст що вивод за доп print

print("Same", "message", "as before") #просто текст що вивод за доп print

print("Just",       # теж просто текст
      "a bit",      # просто ми можемо його переносити
      "bigger")     # як завгодно але не головне не загубити нічого

print("Here", end=" ")  # через те що ми сказали закінчити стрічку " "(пробілом)
print("it is...")       # тепер ця стічка іде після неї а не на новій лінії

print(
        """
         _____       ___       ___  ___   _____  
        /  ___|     /   |     /   |/   | |  ___|        
        | |        / /| |    / /|   /| | | |__   
        | |  _    / ___ |   / / |__/ | | |  __|  
        | |_| |  / /  | |  / /       | | | |___  
        \_____/ /_/   |_| /_/        |_| |_____|
         
         _____   _     _   _____   _____   
        /  _  \ | |   / / |  ___| |  _  \  
        | | | | | |  / /  | |__   | |_| |  
        | | | | | | / /   |  __|  |  _  /  
        | |_| | | |/ /    | |___  | | \ \  
        \_____/ |___/     |_____| |_|  \_\

        """
     ) # через """ (потрійні лапки) збереглись усі пробіли і як має це виглядати тому от такий текс виходить

input("\n\nPress the enter key to exit.") # просто функція що приймає число

##########################################################################################
# Завдання 3
print("\n\tЗавдання 3\n")

a = 1             # звичайна програма де ми створюємо вручну а та b
b = 2           
c = a + b         # потім ми додаєм a i b 
print('c = ', c)  # просто виводимо результат

a = input("Enter number a -> ") #а тепер людина може сама вести що хоче 
b = input("Enter number b -> ")
c = a + b  # і воно додастся тут але є одне не через те що ми не перевили це в числа вони просто склеяться і буде там не 5 + 5 = 10 а 55
print('c = ', c)                # виведеться тут

##########################################################################################
# Завдання 4
print("\n\tЗавдання 4\n")

print(
"""
            Trust Fund Buddy

Totals your monthly spending so that your trust fund doesn't run out
(and you're forced to get a real job).

Please enter the requested, monthly costs.  Since you're rich, ignore pennies
and use only dollar amounts.

"""
)
# програма рацювала неправильно тому що ми не перевили отриману інформацію в потрібний тип тому строки просто склеїлись а не додались як числа
car =  int(input("Lamborghini Tune-Ups: "))
rent = int(input("Manhattan Apartment: "))
jet = int(input("Private Jet Rental: "))
gifts = int(input("Gifts: "))
food = int(input("Dining Out: "))
staff = int(input("Staff (butlers, chef, driver, assistant): "))
guru = int(input("Personal Guru and Coach: "))
games = int(input("Computer Games: "))

total = car + rent + jet + gifts + food + staff + guru + games

print("\nGrand Total:", total)

input("\n\nPress the enter key to exit.")

##########################################################################################
# Завдання 5
# Стріхарчук Анна 23 в списку тобто 9 варіант
print("\n\tЗавдання 5\n")

x = float(input("Enter number x -> "))
y = float(input("Enter number y -> "))
z = float(input("Enter number z -> "))
result = (x / (y - 125.5)) + ((z - 11.7) / (x ** 2)) 

print("({} / ({} - 125.5)) + (({} - 11.7) / {}^2) = {:.2f}".format(x, y, z, x, result))

##########################################################################################
# Завдання 6
print("\n\tЗавдання 6\n")

a = math.pow(5, 3) #  функція pow підносить число до степення яке ми написем
b = 5 ** 3 # "**" теж підносить число до степеню
print(a) # 125
print(b) # 125

##########################################################################################
# Завдання 7
print("\n\tЗавдання 7\n")

value1 = 5  #просто створюємо змінні
value2 = 25
value3 = 100
print(math.sqrt(value1)) # тут вже вносимо під квадратний корень змінні
print(math.sqrt(value2))
print(math.sqrt(value3))

##########################################################################################
# Завдання 8
print("\n\tЗавдання 8\n")

print(math.e)               # виведить число е
print(math.pi)              # виведить число рі
print(math.cos(math.pi))    # виведить косинус числа рі
print(math.sin(math.pi))    # виведить синус числа рі

##########################################################################################
# Завдання 9
# Стріхарчук Анна 23 в списку тобто 9 варіант
print("\n\tЗавдання 9\n")

a = float(input("Введіть сторону правильної трик призми а -> "))
h = float(input("Введіть висоту правильної трик призми h -> "))
S = (a / 2) * (a * math.sqrt(3) + 6 * h)

print(f"Повна поверхня правильного трикутника призми = {S:.2f}")